Documents/ЛБ_РеестрПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_РеестрПлатежей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_РаспределенныеБезналичныеПлатежи</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СостояниеРеестраПлатежей</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_БезналичныеПлатежиКРаспределению</xr:Item>
				<xr:Item>InformationRegister.ЛБ_РеестрБезначныхПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыБезналичныхПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРеестра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПлатежиБН</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЗБ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗалоговыйБилет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИОЗаемщика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИОПлательщика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПлатежиЛК</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЗБ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗалоговыйБилет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ЛБ_ВидыБезналичныхПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыБезналичныхПлатежей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РасчетыйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныйКабинет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_РеестрПлатежей/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда   
		Объект.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет;
		Объект.Ответственный = Пользователи.ТекущийПользователь(); 
	Иначе 
		Этаформа.ТолькоПросмотр = Истина;
	КонецЕсли;
	УстановитьВидимость(); 
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура УстановитьВидимость() 
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет Тогда  
		Элементы.ГруппаПлатежиЛК.Видимость = Ложь;
		Элементы.ГруппаПлатежиБН.Видимость = Истина;
	Иначе   
		Элементы.ГруппаПлатежиЛК.Видимость = Истина;
		Элементы.ГруппаПлатежиБН.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗБ(НомерЗБ)  
	Если НЕ ПустаяСтрока(НомерЗБ) Тогда
	    Возврат ЛБ_Общиймодуль.ПолучитьЗБПоНомеру(НомерЗБ);  
	КонецЕсли;
	Возврат Документы.ЛБ_ОперацияПоЗалогу.ПустаяСсылка();
КонецФункции

&НаКлиенте
Процедура ЗагрузитьЛКНаКлиенте() Экспорт
	Попытка
		Эксель = Новый COMОбъект("Excel.Application");
		Эксель.Visible = 0;
		Эксель.DisplayAlerts = 0;
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось прочитать файл по причине: " + ОписаниеОшибки();
		Сообщение.Сообщить();
	    Возврат;
	КонецПопытки;
	
	Книга = Эксель.Workbooks.Open(ФайлЗагрузки);
	КоличествоЛистов = Книга.Sheets.Count;
	
	Лист = Книга.Sheets(1);
	КоличествоСтрок = Лист.Cells(1,1).SpecialCells(11).Row;
	КоличествоКолонок = Лист.Cells(1,1).SpecialCells(11).Column;
	
	Попытка
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыБезналичныхПлатежей.ЛичныйКабинет") Тогда
			Объект.ПлатежиЛК.Очистить();
			
			Для НомерСтроки = 1 По КоличествоСтрок Цикл
				Состояние("Внимание!", НомерСтроки+10, "Загрузка может занять некоторое время", БиблиотекаКартинок.ДлительнаяОперация48);
				Если НомерСтроки = 1 Тогда
					Продолжить;			
				КонецЕсли;  
				Если НЕ СокрЛП(Лист.Cells(НомерСтроки, 4).Value) = "Оплачен" тогда
				    Продолжить;			
				КонецЕсли;        
				ДатаПлатежа = Дата(Лист.Cells(НомерСтроки, 2).Value); 
				ИдентификаторПлатежа = Лист.Cells(НомерСтроки, 3).Value;    
				
				СтрокаПлатежи = Лист.Cells(НомерСтроки, 8).Value;
				МассивРезультат = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаПлатежи,",");   
				
				Для каждого Строка из МассивРезультат Цикл 
					СтрокаП = сокрЛП(Строка);
					Поз = Найти(СтрокаП, "-ЛК:"); 
					НомерЗБ = Сред(СтрокаП, 1, Поз-1);
					СтрокаСумма = Сред(СтрокаП, Поз+4); 
					ЗалоговыйБилет = ПолучитьЗБ(НомерЗБ);
					
					СтрокаТаблицы = Объект.ПлатежиЛК.Добавить();
					СтрокаТаблицы.ДатаПлатежа = ДатаПлатежа;
					СтрокаТаблицы.ИдентификаторПлатежа = ИдентификаторПлатежа;
					СтрокаТаблицы.НомерЗБ = НомерЗБ; 
					СтрокаТаблицы.ЗалоговыйБилет = ЗалоговыйБилет;
					СтрокаТаблицы.СуммаПлатежа = Число(СтрокаСумма);
				Конеццикла;	
			КонецЦикла;  
		ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыБезналичныхПлатежей.РасчетыйСчет") Тогда
			Объект.ПлатежиБН.Очистить();
			
			Для НомерСтроки = 1 По КоличествоСтрок Цикл
				Состояние("Внимание!", НомерСтроки+10, "Загрузка может занять некоторое время", БиблиотекаКартинок.ДлительнаяОперация48);
				Если НомерСтроки = 1 Тогда
					Продолжить;			
				КонецЕсли;          
								
				СтрокаТаблицы = Объект.ПлатежиБН.Добавить();
				СтрокаТаблицы.НомерПП = Формат(Лист.Cells(НомерСтроки, 1).Value, "ЧГ=0"); 
				СтрокаТаблицы.ДатаПлатежа = Дата(Лист.Cells(НомерСтроки, 2).Value);;
				СтрокаТаблицы.СуммаПлатежа = Число(Лист.Cells(НомерСтроки, 3).Value); 
				НомерЗБ = Лист.Cells(НомерСтроки, 4).Value;
				Поз = Найти(НомерЗБ, "-ЛК"); 
				НомерЗБ = Сред(НомерЗБ, 1, Поз-1);
				СтрокаТаблицы.НомерЗБ = НомерЗБ; 
				ЗалоговыйБилет = ПолучитьЗБ(НомерЗБ);
				СтрокаТаблицы.ЗалоговыйБилет = ЗалоговыйБилет;
				СтрокаТаблицы.ФИОЗаемщика = Лист.Cells(НомерСтроки, 5).Value;
				СтрокаТаблицы.ФИОПлательщика = Лист.Cells(НомерСтроки, 6).Value;
			КонецЦикла;  
		КонецЕсли;
		Состояние("Внимание!", 100, "Загрузка может занять некоторое время", БиблиотекаКартинок.ДлительнаяОперация48);  
	Исключение
		Сообщить("Проверьте соответствие файла выбранной операции или обратитесь к разработчикам.", СтатусСообщения.Внимание);
	КонецПопытки;
	
	Эксель.Workbooks.Close();
	Эксель.Quit();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЛК(Команда)   
	Если Пустаястрока(ФайлЗагрузки) тогда  
		Предупреждение("Не выбран файл для загрузки!", 60);
	КонецЕсли;	
	Состояние("Внимание!", 10, "Загрузка может занять некоторое время", БиблиотекаКартинок.ДлительнаяОперация48);
	ЗагрузитьЛКНаКлиенте();
КонецПроцедуры   

&НаКлиенте
Процедура ФайлЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр 			= НСтр("ru=’Книга Excel 97 (*.xls)|*.xls|Книга Excel 2007 (*.xlsx)|*.xlsx'");
	Диалог.Заголовок 		= НСтр("ru=’Выберите файл Excel'");
	ОповещениеЗавершения 	= Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект);
	
	Диалог.Показать(ОповещениеЗавершения);
КонецПроцедуры      

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		ФайлЗагрузки = ВыбранныеФайлы[0];   
		СтруктураФайла = Новый Файл(ФайлЗагрузки);
		Объект.ИмяФайла = СокрЛП(СтруктураФайла.ИмяБезРасширения);
		Поз = Найти(Объект.ИмяФайла, " ");
		Если НЕ Поз = 0 Тогда
		    Объект.НомерРеестра = Лев(Объект.ИмяФайла, Поз-1);
	    Иначе
		    Объект.НомерРеестра = Объект.ИмяФайла;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры


&НаКлиенте
Процедура ПлатежиБННомерЗБПриИзменении(Элемент)
	ТекСтрока = Элементы.ПлатежиБН.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда                       
	    ТекСтрока.ЗалоговыйБилет = ПолучитьЗБ(ТекСтрока.НомерЗБ); 	
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ПлатежиЛКНомерЗБПриИзменении(Элемент)
	ТекСтрока = Элементы.ПлатежиЛК.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда                       
	    ТекСтрока.ЗалоговыйБилет = ПолучитьЗБ(ТекСтрока.НомерЗБ); 	
	КонецЕсли;	
КонецПроцедуры
